# 1. Вказуємо базовий образ (будуємо з офіційного образу Node.js)
FROM node:18

# 2. Встановлюємо робочу директорію
WORKDIR /app

# 3. Копіюємо package.json і package-lock.json для інсталяції залежностей
COPY package*.json ./

# 4. Встановлюємо залежності
RUN npm install

# 5. Копіюємо решту файлів проекту в контейнер
COPY . .

# 6. Створюємо збірку для продакшн середовища
RUN npm run build

# 7. Вказуємо, який порт буде використовувати додаток
EXPOSE 3000

# 8. Команда для запуску сервера
CMD ["npm", "start"]
